; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v3 ?v2)
             (pred_8 ?v4 ?v9)
             (pred_10 ?v3 ?v9)
             (pred_2 ?v11 ?v3 )
	     (pred_6 ?v3)
             (pred_9 ?v10)
             (pred_11 ?v4)
             (pred_4 ?v9)
             (pred_5 ?v3)
             (pred_3 ?v4)
             (pred_12 ?v3)
             (pred_7 ))



(:action op_4
:parameters (?v7 ?v13 ?v12 ?v6)
:precondition (and (pred_9 ?v7) (pred_9 ?v13) (pred_11 ?v12) (pred_4 ?v6)
          (pred_1 ?v7 ?v13) (pred_8 ?v12 ?v6)
                   (pred_10 ?v13 ?v6) (pred_6 ?v7) 
                   (pred_5 ?v13) (pred_3 ?v12))
:effect (and  (pred_12 ?v13) (not (pred_5 ?v13))))


(:action op_1
:parameters (?v7 ?v1)
:precondition (and (pred_9 ?v7) (pred_9 ?v1)
               (pred_6 ?v7) (pred_1 ?v7 ?v1) (pred_12 ?v1))
:effect (and (pred_6 ?v1) (not (pred_6 ?v7))))

(:action op_2
:parameters (?v7 ?v12)
:precondition (and (pred_9 ?v7) (pred_11 ?v12) 
                  (pred_6 ?v7) (pred_2 ?v12 ?v7) (pred_7 ))
:effect (and (pred_3 ?v12)
   (not (pred_2 ?v12 ?v7)) (not (pred_7 ))))


(:action op_3
:parameters (?v7 ?v8 ?v5)
:precondition (and (pred_9 ?v7) (pred_11 ?v8) (pred_11 ?v5)
                  (pred_6 ?v7) (pred_3 ?v5) (pred_2 ?v8 ?v7))
:effect (and (pred_3 ?v8) (pred_2 ?v5 ?v7)
        (not (pred_3 ?v5)) (not (pred_2 ?v8 ?v7))))

(:action op_5
:parameters (?v7 ?v12)
:precondition (and (pred_9 ?v7) (pred_11 ?v12) 
                  (pred_6 ?v7) (pred_3 ?v12))
:effect (and (pred_7 ) (pred_2 ?v12 ?v7) (not (pred_3 ?v12)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_17 obj_01 obj_09 obj_14 obj_16 obj_05 obj_13 obj_02 obj_11 obj_18 obj_07 obj_12 obj_06 obj_19 obj_08 obj_20
    obj_03 obj_15
    obj_04 obj_10
    )

    (:init
       (pred_7)

       (pred_9 obj_17)
       (pred_9 obj_01)
       (pred_9 obj_09)
       (pred_9 obj_14)
       (pred_9 obj_16)
       (pred_9 obj_05)
       (pred_9 obj_13)
       (pred_9 obj_02)
       (pred_9 obj_11)
       (pred_9 obj_18)
       (pred_9 obj_07)
       (pred_9 obj_12)
       (pred_9 obj_06)
       (pred_9 obj_19)
       (pred_9 obj_08)
       (pred_9 obj_20)
       (pred_4 obj_03)
       (pred_4 obj_15)
       (pred_11 obj_04)
       (pred_11 obj_10)

       (pred_1 obj_17 obj_16)
       (pred_1 obj_17 obj_01)
       (pred_1 obj_01 obj_05)
       (pred_1 obj_01 obj_09)
       (pred_1 obj_01 obj_17)
       (pred_1 obj_09 obj_13)
       (pred_1 obj_09 obj_14)
       (pred_1 obj_09 obj_01)
       (pred_1 obj_14 obj_02)
       (pred_1 obj_14 obj_09)
       (pred_1 obj_16 obj_11)
       (pred_1 obj_16 obj_05)
       (pred_1 obj_16 obj_17)
       (pred_1 obj_05 obj_18)
       (pred_1 obj_05 obj_13)
       (pred_1 obj_05 obj_01)
       (pred_1 obj_05 obj_16)
       (pred_1 obj_13 obj_07)
       (pred_1 obj_13 obj_02)
       (pred_1 obj_13 obj_09)
       (pred_1 obj_13 obj_05)
       (pred_1 obj_02 obj_12)
       (pred_1 obj_02 obj_14)
       (pred_1 obj_02 obj_13)
       (pred_1 obj_11 obj_06)
       (pred_1 obj_11 obj_18)
       (pred_1 obj_11 obj_16)
       (pred_1 obj_18 obj_19)
       (pred_1 obj_18 obj_07)
       (pred_1 obj_18 obj_05)
       (pred_1 obj_18 obj_11)
       (pred_1 obj_07 obj_08)
       (pred_1 obj_07 obj_12)
       (pred_1 obj_07 obj_13)
       (pred_1 obj_07 obj_18)
       (pred_1 obj_12 obj_20)
       (pred_1 obj_12 obj_02)
       (pred_1 obj_12 obj_07)
       (pred_1 obj_06 obj_19)
       (pred_1 obj_06 obj_11)
       (pred_1 obj_19 obj_08)
       (pred_1 obj_19 obj_18)
       (pred_1 obj_19 obj_06)
       (pred_1 obj_08 obj_20)
       (pred_1 obj_08 obj_07)
       (pred_1 obj_08 obj_19)
       (pred_1 obj_20 obj_12)
       (pred_1 obj_20 obj_08)
       (pred_5 obj_14)
       (pred_5 obj_16)
       (pred_10  obj_14 obj_03)
       (pred_10  obj_16 obj_15)
       (pred_12 obj_17)
       (pred_12 obj_01)
       (pred_12 obj_09)
       (pred_12 obj_05)
       (pred_12 obj_13)
       (pred_12 obj_02)
       (pred_12 obj_11)
       (pred_12 obj_18)
       (pred_12 obj_07)
       (pred_12 obj_12)
       (pred_12 obj_06)
       (pred_12 obj_19)
       (pred_12 obj_08)
       (pred_12 obj_20)

       (pred_8  obj_04 obj_03)
       (pred_8  obj_10 obj_15)
       (pred_2 obj_04 obj_07)
       (pred_2 obj_10 obj_17)
       (pred_6 obj_20)
    )

    (:goal (and
       (pred_2 obj_04 obj_19)
       (pred_2 obj_10 obj_05)
    ))
(:constraints
  (always (not (pred_6 obj_18)))
)
)

; plan
1. (op_1 obj_20 obj_08)
   deleted: (pred_6 obj_20)
   added: (pred_6 obj_08)
   goals met: 0 of 2
2. (op_1 obj_08 obj_07)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_07)
   goals met: 0 of 2
3. (op_2 obj_07 obj_04)
   deleted: (pred_2 obj_04 obj_07) (pred_7)
   added: (pred_3 obj_04)
   goals met: 0 of 2
4. (op_1 obj_07 obj_13)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_13)
   goals met: 0 of 2
5. (op_1 obj_13 obj_05)
   deleted: (pred_6 obj_13)
   added: (pred_6 obj_05)
   goals met: 0 of 2
6. (op_1 obj_05 obj_01)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_01)
   goals met: 0 of 2
7. (op_1 obj_01 obj_17)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_17)
   goals met: 0 of 2
8. (op_3 obj_17 obj_10 obj_04)
   deleted: (pred_3 obj_04) (pred_2 obj_10 obj_17)
   added: (pred_3 obj_10) (pred_2 obj_04 obj_17)
   goals met: 0 of 2
9. (op_1 obj_17 obj_01)
   deleted: (pred_6 obj_17)
   added: (pred_6 obj_01)
   goals met: 0 of 2
10. (op_1 obj_01 obj_05)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_05)
   goals met: 0 of 2
11. (op_5 obj_05 obj_10)
   deleted: (pred_3 obj_10)
   added: (pred_7) (pred_2 obj_10 obj_05)
   goals met: 1 of 2
12. (op_1 obj_05 obj_01)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_01)
   goals met: 1 of 2
13. (op_1 obj_01 obj_17)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_17)
   goals met: 1 of 2
14. (op_2 obj_17 obj_04)
   deleted: (pred_2 obj_04 obj_17) (pred_7)
   added: (pred_3 obj_04)
   goals met: 1 of 2
15. (op_1 obj_17 obj_01)
   deleted: (pred_6 obj_17)
   added: (pred_6 obj_01)
   goals met: 1 of 2
16. (op_1 obj_01 obj_05)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_05)
   goals met: 1 of 2
17. (op_1 obj_05 obj_13)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_13)
   goals met: 1 of 2
18. (op_1 obj_13 obj_07)
   deleted: (pred_6 obj_13)
   added: (pred_6 obj_07)
   goals met: 1 of 2
19. (op_1 obj_07 obj_08)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_08)
   goals met: 1 of 2
20. (op_1 obj_08 obj_19)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_19)
   goals met: 1 of 2
21. (op_5 obj_19 obj_04)
   deleted: (pred_3 obj_04)
   added: (pred_7) (pred_2 obj_04 obj_19)
   goals met: 2 of 2
